In [1]:
from pandas import DataFrame
df=DataFrame(
            [
                ['Aryan','Singh','Full Time','administraction',2,20000],
                ['Rohan','Agarwal','intern','Technical',3,50000],
                ['Rjya','Shah','Full Time','administraction',5,100000],
                ['Yash','Bhaita','Part Time','Technical',7,100000],
                ['Siddhant','Khanna','Full Time','Management',6,200000],
            ]
            ,columns=['Frist Name','Last Name','Type','Department','YoE','Salary']
            )
df

  Frist Name Last Name       Type       Department  YoE  Salary
0      Aryan     Singh  Full Time  administraction    2   20000
1      Rohan   Agarwal     intern        Technical    3   50000
2       Rjya      Shah  Full Time  administraction    5  100000
3       Yash    Bhaita  Part Time        Technical    7  100000
4   Siddhant    Khanna  Full Time       Management    6  200000

1.Make a pivot table which shows average salary of each type of employee for each department.

In [2]:
import pandas as pd
table=pd.pivot_table(df,index='Type',columns='Department',values='Salary',aggfunc='sum')
table

Department  Management  Technical  administraction
Type
Full Time     200000.0        NaN         120000.0
Part Time          NaN   100000.0              NaN
intern             NaN    50000.0              NaN

2. Make a pivot table which shows the sum and mean of the salaries of each type of employee and the number of employees of each type.

In [3]:
table =pd.pivot_table(df,index='Type',values='Salary',aggfunc=['sum','mean','count'])
table

              sum           mean  count
           Salary         Salary Salary
Type
Full Time  320000  106666.666667      3
Part Time  100000  100000.000000      1
intern      50000   50000.000000      1

3.Display a pivot table to count survial by gender,categorise wise age of varies 
category1-0-10
category2-10-30
category3-30-60
category4-60-80

In [4]:
df=pd.read_csv("dataset/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,NaN,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,NaN,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,NaN,NaN,S
3,4,NaN,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1.0,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1.0,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0.0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
df=pd.read_csv("dataset/titanic.csv")
age=pd.cut(df['Age'],[0,10,30,60,80])
result=df.pivot_table('Survived',index=['Sex',age],columns='Pclass',aggfunc='count')
print(result)

Pclass            1   2    3
Sex    Age
female (0, 10]    1   8   22
       (10, 30]  34  36   56
       (30, 60]  46  30   22
       (60, 80]   2   0    1
male   (0, 10]    2   9   22
       (10, 30]  24  43  151
       (30, 60]  63  44   76
       (60, 80]  12   3    4